<a href="https://colab.research.google.com/github/aas6188/Group-Project-3/blob/main/Group_Assignment_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

![ER Diagram](https://raw.githubusercontent.com/BlueCoder13/PracticeForClass/master/Images/Copy%20of%20Group-Project%202.jpg)

In [ ]:
%load_ext sql
%sql sqlite:///librariesDataBase.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @librariesDataBase.db'

In [ ]:
%%sql  
DROP TABLE IF EXISTS People;
create table People (CardNumber text PRIMARY KEY, FirstName text, LastName text, Age integer);

DROP TABLE IF EXISTS Program;
create table Program (ProgramID text PRIMARY KEY, StaffID text, ProgramName text, CardNumber text, Section integer, NumberOfParticipates integer);

DROP TABLE IF EXISTS Staff;
create table Staff (StaffID text PRIMARY KEY, FirstName text, LastName text, DateHired text);

DROP TABLE IF EXISTS Section;
create table Section (AreaNumber integer PRIMARY KEY, Volume real, PeopleCapacity integer, Seats integer);

DROP TABLE IF EXISTS Books;
create table Books (SerialNumber text PRIMARY KEY, Title text, AuthorFirstName text, AuthorLastName text);

DROP TABLE IF EXISTS Checkout;
create table Checkout (CardNumber text PRIMARY KEY, SerialNumber text, Date text);

 * sqlite:///librariesDataBase.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [ ]:
%%sql
insert into People values ('001', 'Troy', 'Yates', 62);
insert into People values ('056', 'Heather', 'Graham', 22);
insert into People values ('097', 'Elin', 'Sheppard', 35);
insert into People values ('011', 'Christian', 'Fhan', 18);
insert into People values ('009', 'Jack', 'Liam', 45);
insert into People values ('005', 'Lois', 'Haas', 17);
insert into People values ('049', 'Betty', 'lese', 37);
insert into People values ('073', 'Max', 'Norton', 55);
insert into People values ('088', 'Maisy', 'Humphry', 31);
insert into People values ('031', 'Donald', 'Craig', 78);
insert into People values ('027', 'Jamie', 'Franco', 25);

insert into Staff values ('S23', 'Orla', 'Peck', '2012-05-26');
insert into Staff values ('S54', 'Karen', 'Santos', '2017-02-28');
insert into Staff values ('S01', 'Harry', 'Merriot', '2019-12-15');
insert into Staff values ('S69', 'Jay', 'Jenson', '2011-03-29');
insert into Staff values ('S12', 'Mark', 'Lamb', '2004-01-27');
insert into Staff values ('S07', 'Edith', 'Bass', '2001-06-01');
insert into Staff values ('S56', 'Harley', 'McKay', '2020-10-09');
insert into Staff values ('S99', 'Nathan', 'Sue', '2009-06-15');
insert into Staff values ('S65', 'Micheal', 'Noble', '2000-04-13');
insert into Staff values ('S32', 'Caroline', 'Halle', '2003-02-18');

insert into Section values (002, 1200, 500, 450);
insert into Section values (003, 2300, 580, 500 );
insert into Section values (004, 3400, 700, 650);
insert into Section values (005, 1150, 675, 300);
insert into Section values (006, 2450, 600, 515);

insert into Program values ('P1R','S23', 'Summer Reading', '001', 002, 40);
insert into Program values ('P2R', 'S54', 'Typing Lab', '056', 003, 20);
insert into Program values ('P3R', 'S01', 'Book Club', '097', 004, 100);
insert into Program values ('P4R', 'S69', 'Movie Night Club', '011', 005, 230);
insert into Program values ('P5R', 'S12', 'Teen Summer Reading','009', 006, 55);

insert into Books values ('67893839', 'Harry Potter and the Chamber of Secrets', 'J.K.', 'Rowling');
insert into Books values ('72889795', 'The Hate U Give', 'Angie', 'Thomas');
insert into Books values ('93889974', 'Start with Why', 'Simon', 'Sinek');
insert into Books values ('49553929', 'Homegoing','Yaa', 'Gyasi');
insert into Books values ('66357266', 'The Hunger Games', 'Suzanne', 'Collins');

insert into Checkout values ('001', '67893839', '2020-05-26');
insert into Checkout values ('056', '72889795', '2020-02-28');
insert into Checkout values ('097', '93889974', '2019-07-04');
insert into Checkout values ('011', '72889795', '2018-10-20');
insert into Checkout values ('009', '66357266', '2019-08-31');

 * sqlite:///librariesDataBase.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Questions

1. How many books were checked out by people under 45 years old.

In [ ]:
%%sql
SELECT count(serialNumber) from Checkout where CardNumber in (select CardNumber from People where Age < 45);

 * sqlite:///librariesDataBase.db
Done.

[(3,)]

2. What was the amount of books checked out by people between 2019-01-01 and 2020-01-01

In [ ]:
%%sql
SELECT count(SerialNumber) from Checkout where Date between "2019-01-01" and "2020-01-01";

 * sqlite:///librariesDataBase.db
Done.

[(2,)]

3. What Members of the Library has an E in their First Name.

In [ ]:
%%sql
SELECT FirstName, LastName from People where FirstName like "%e%";

 * sqlite:///librariesDataBase.db
Done.

[('Heather', 'Graham'),
 ('Elin', 'Sheppard'),
 ('Betty', 'lese'),
 ('Jamie', 'Franco')]

50 word writeup

When we created our Database and Tables, we only decided to do one change. That change was adding an attribute called ProgramName to the Sections table. This change was made because we thought that it would make it easier to know what each program is. These results do add up to my expectations because we made our diagram in First Normal Form, and that matches up well with the SQL input.